# St7GetNumModes

Returns the number of modes included in the modal superposition in the result file currently open.

long St7GetNumModes(long uID, long* NumModes)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumModes

Number of modes.

Applicability

Applicable to stNaturalFrequency and stHarmonicResponse.